Revit 2026 API

# MaterialMaterialClass Property

---

The name of the general material type, e.g. 'Wood.'

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string MaterialClass { get; set; }
```
```vb
Public Property MaterialClass As String
	Get
	Set
```
```cpp
public:
property String^ MaterialClass {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member MaterialClass : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

Material Class

Autodesk.Revit.DB Namespace